13/data/attachments/a1947058b5974309.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d48cf0e5-4576-4905-a41c-0134eedbb505</nif:username>
            <nif:friendToBeAdded>Bradley_must_Friend_46643_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>